app/controllers/filmes_controller.rb

  def index
    @filmes = Filme.all
---
SELECT "filmes".* FROM "filmes"

  def create
    @filme = Filme.new(filme_params)

    respond_to do |format|
      if @filme.save
---
INSERT INTO "filmes" ("title", "release_year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Joazinho"], ["release_year", 2010], ["created_at", "2022-11-21 00:50:53.971952"], ["updated_at", "2022-11-21 00:50:53.971952"]]

  def set_actors
    @actors=Actor.all.pluck(:name, :id)
---
SELECT "actors"."name", "actors"."id" FROM "actors"

    def set_filme
      @filme = Filme.find(params[:id])
---
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]